feat: walkthrough and flow
